# ExtrusionTooThin Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ExtrusionFailures..::..ExtrusionTooThin Property
BuiltInFailures..::..ExtrusionFailures Class See Also
---
Extrusion is too thin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ExtrusionTooThin { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExtrusionTooThin As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ExtrusionTooThin {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ExtrusionFailures Class
Autodesk.Revit.DB Namespace